{"class_name": "Sequential", "keras_version": "1.1.0", "config": [{"class_name": "Embedding", "config": {"trainable": true, "name": "embedding_1", "activity_regularizer": null, "W_constraint": null, "init": "uniform", "input_dtype": "int32", "mask_zero": false, "input_dim": 19500, "batch_input_shape": [null, 56], "W_regularizer": null, "dropout": 0.0, "output_dim": 50, "input_length": 56}}, {"class_name": "Dropout", "config": {"p": 0.25, "batch_input_shape": [null, 56, 50], "trainable": true, "name": "dropout_1", "input_dtype": "float32"}}, {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 56, 50], "sparse": false, "input_dtype": "float32", "name": "input_1"}, "name": "input_1"}, {"class_name": "Convolution1D", "inbound_nodes": [[["input_1", 0, 0]]], "config": {"input_length": null, "W_constraint": null, "b_constraint": null, "name": "convolution1d_1", "activity_regularizer": null, "trainable": true, "filter_length": 3, "init": "uniform", "bias": true, "nb_filter": 150, "input_dim": null, "subsample_length": 1, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "border_mode": "valid"}, "name": "convolution1d_1"}, {"class_name": "Convolution1D", "inbound_nodes": [[["input_1", 0, 0]]], "config": {"input_length": null, "W_constraint": null, "b_constraint": null, "name": "convolution1d_2", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "uniform", "bias": true, "nb_filter": 150, "input_dim": null, "subsample_length": 1, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "border_mode": "valid"}, "name": "convolution1d_2"}, {"class_name": "Convolution1D", "inbound_nodes": [[["input_1", 0, 0]]], "config": {"input_length": null, "W_constraint": null, "b_constraint": null, "name": "convolution1d_3", "activity_regularizer": null, "trainable": true, "filter_length": 5, "init": "uniform", "bias": true, "nb_filter": 150, "input_dim": null, "subsample_length": 1, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "border_mode": "valid"}, "name": "convolution1d_3"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convolution1d_1", 0, 0]]], "config": {"stride": 2, "pool_length": 2, "trainable": true, "name": "maxpooling1d_1", "border_mode": "valid"}, "name": "maxpooling1d_1"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convolution1d_2", 0, 0]]], "config": {"stride": 2, "pool_length": 2, "trainable": true, "name": "maxpooling1d_2", "border_mode": "valid"}, "name": "maxpooling1d_2"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convolution1d_3", 0, 0]]], "config": {"stride": 2, "pool_length": 2, "trainable": true, "name": "maxpooling1d_3", "border_mode": "valid"}, "name": "maxpooling1d_3"}, {"class_name": "Flatten", "inbound_nodes": [[["maxpooling1d_1", 0, 0]]], "config": {"trainable": true, "name": "flatten_1"}, "name": "flatten_1"}, {"class_name": "Flatten", "inbound_nodes": [[["maxpooling1d_2", 0, 0]]], "config": {"trainable": true, "name": "flatten_2"}, "name": "flatten_2"}, {"class_name": "Flatten", "inbound_nodes": [[["maxpooling1d_3", 0, 0]]], "config": {"trainable": true, "name": "flatten_3"}, "name": "flatten_3"}, {"class_name": "Merge", "inbound_nodes": [[["flatten_1", 0, 0], ["flatten_2", 0, 0], ["flatten_3", 0, 0]]], "config": {"name": "merge_1", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "name": "merge_1"}], "input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["merge_1", 0, 0]]}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 150}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 2}}]}